hybrid_method/default_fv_case/wall_functions/constant/turbulenceProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object turbulenceProperties;
}

simulationType RAS;

RAS
{
  RASModel kOmegaSST;
  turbulence yes;
  printCoeffs yes;
}

freestream
{
  UInf (243.158 0 0);
  pInf 23842.297202006892; 	//(250 0 0);//159178.56;
  TInf 218.808; 	//273.15;
  k 0.08868858935025599;
  omega 54371.741848824364; 	//2.85e-07;
  gamma 1.4;
  blendLevel 0.75;
  rhoInf 0.37959693902751024;
} 	// ************************************************************************* //

