hybrid_method/default_fv_case/wall_functions/0/p
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object p;
}

#include "include/freestreamConditions"
dimensions [ 1 -1 -2 0 0 0 0 ];

internalField uniform $p;

boundaryField
{
  inlet
  {
    type characteristicFarfieldPressure;
	#include "include/freestreamConditions"
    value $internalField;
  }
  outlet
  {
    type characteristicFarfieldPressure;
	#include "include/freestreamConditions"
    value $internalField;
  }
  atmosphere
  {
    type characteristicFarfieldPressure;
	#include "include/freestreamConditions"
    value $internalField;
  }
     "nac_.*"
  {
    type characteristicWallPressure;
    value uniform 0;
  }
    "fuse_.*"
  {
    type characteristicWallPressure;
    value uniform 0;
  }
    wedge_left
    {
		type 		    wedge;
    }	
    wedge_right
    {
	    type 		    wedge;
    }
} 	// ************************************************************************* //

