hybrid_method/default_fv_case/wall_functions/0/fanBCs/F
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii ;
class volVectorField ;
location "0";
object F ;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [1 -2 -2 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
"nac_.*"
{
type zeroGradient;
}
"fuse_.*"
{
type zeroGradient;
}
"(inlet|atmosphere)"
{
type zeroGradient;
}
outlet
{
type zeroGradient ;
}
"(wedge_left|wedge_right)"
{
type            wedge;
}
}

// ************************************************************************* //
