hybrid_method/default_fv_case/wall_functions/system/fSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object fvSolution;
}

solvers
{
  "(k|omega)"
  {
    solver smoothSolver;
    smoother symGaussSeidel;
    tolerance 1e-6;
    relTol 0.1;
    minIter 1;
  }
  "(k|omega)Final"
  {
    solver smoothSolver;
    smoother symGaussSeidel;
    tolerance 1e-8;
    reltol 0;
    minIter 1;
  }
  yPsi
  {
    solver GAMG;
    smoother GaussSeidel;
    cacheAgglomeration yes;
    nCellsInCoarsestLevel 10;
    agglomerator faceAreaPair;
    mergeLevels 1;
    tolerance 1e-10;
    relTol 0.001;
  }
}

fanCharacteristics
{
  inletPatch fanInlet;
  outletPatch fanOutlet; 	// Definition of fan inlet patch (boundary)// Definition of fan outlet patch (boundary)
  FPR 1.25; 	// Definition of fan pressure ratio
  eta_p_fan 0.925; 	// Definition of polytropic fan efficiency //pAtmospheric 		101325;	      // atmospheric pressure//tAtmospheric		273.15;       // atmospheric temperature
  printInfo 1;
  pressureLimitation 1;
  temperatureLimitation 1;
  blendLevel 1;
}

relaxationFactors
{
  equations
  {
    k 0.5;
    omega 0.5;
    nut 0.3;
    p 0.5;
    rho 0.5;
    U 0.5;
    T 0.5;
  }
}

Jacobian LaxFriedrich;

flowSolver
{
  solver GMRES;
  GMRES
  {
    inviscidJacobian LaxFriedrich;
    viscousJacobian laplacian;
    preconditioner LUSGS;
    maxIter 20;
    nKrylov 8;
    solverTolRel         0.1         (0.1 0.1 0.1)         0.1 ;
nNonOrthogonalCorrectors 3;
  }
}

pseudoTime
{
  nPseudoCorr 20;
  pseudoTol       1e-06       (1e-06 1e-06 1e-06)       1e-06 ; 	//nNonOrthogonalCorrectors 2;
  pseudoTolRel       0.01       (0.01 0.01 0.01)       0.01 ;
  pseudoCoNum 1.0;
  pseudoCoNumMax 20.0;
  localTimestepping yes;
} 	// ************************************************************************* //

