hybrid_method/default_fv_case/wall_functions/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    fanSet;
        type    cellSet;
        action  new;
        source  zoneToCell;
        zones
        (
        	stator
		rotor          
        );    
}
    {
        name    fan;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set	fanSet;
}
    {
        name    axiSet;
        type    faceSet;
        action  new;
        source  boundaryToFace;
        set	axi;
}

    {
        name    axi;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        faceSet	axiSet;
}
);

// ************************************************************************* //
